<?php
/**
 * Lang.
 *
 * @author taozywu <tao.wu@zerotech.com>
 * @date 2016/10/20
 */
namespace MpaiApi\Config;

class Lang
{
    // 简体中文
    public static $zhCn = array(
        100000001 => '参数有误',
        100000002 => '无数据',
        100000003 => '操作失败',
        100000004 => '未检测到签名信息(sn)',
        100000005 => '未检测到版本信息(v)',
        100000006 => '未检测到时间戳信息(ek)',
        100000007 => '签名验证失败',
        100000008 => '重复请求',
        100000009 => '没有权限',
        100000010 => '系统错误',
        100000011 => '未登录',
        100000012 => '操作成功',
        100000013 => '系统',
        100000014 => '刚刚',
        100000015 => '分钟前',
        100000016 => '小时前',
        100000017 => '天前',
        100000018 => '年',
        100000019 => '月',
        100000020 => '日',
        100000021 => '分钟前',
        100000022 => '小时前',
        100000023 => '天前',
        100000024 => "转码中，请稍后",
        100000025 => "待转码",
        100000026 => "转码失败",
        100000027 => "该作品不存在或已被删除",
    );

    
}
