<?php
namespace Common;
/**
 * @desc	敏感词过滤类
 * @author	hejl@chanjet.com
 * @date	2012-12-20
 * @uses
 * use src\lib\classes\BadWords;
 * BadWords::replaceBadword($str)
 */
class BadWords {
	/*
	 * 敏感词处理接口
	 * @desc	对传递的数据进行处理,并返回 
	 * @param 	string	 $str	需要处理的内容
	 * @return 	string	 $out	过滤后的内容
	 */
	public static function replaceBadword($str){
		$replace = self::$badWords;
		$out = str_replace($replace, '**', $str);
 		return $out;
 	}
 	/*
	 * 敏感词判断
	 * @desc	判断是否是敏感词 
	 * @param 	string	 $str	需要处理的内容
	 * @return 	boolen	 true为是，false为否
	 */
 	public static function isBadword($str){
 		if(in_array($str, self::$badWords)){
 			return true;
 		}else{
 			return false;
 		}
 	}
 	/*
 	 * 敏感词库  
 	 */
	static private $badWords  = array(
        '操B',
        '操逼',
        '操比',
        '操蛋',
        '操你',
        '操你妈',
        '操你媽',
        '操你娘',
        '操死',
        '操他',
        '草你妈',
        '插B',
        '插插',
        '插她',
        '插你',
        '插他',
        '插我',
        '打保单',
        '打倒共产党',
        '打炮',
        '打坦克手册',
        '打砸抢',
        '大b',
        '大逼',
        '大彩',
        '大参考',
        '大法',
        '大法大福',
        '大法大纪园',
        '大法弟子',
        '大法洪传',
        '大法师傅',
        '大法新闻社',
        '大法修炼者',
        '大法之声',
        '大砝弟子',
        '大珐',
        '大花逼',
        '大鸡巴',
        '法+轮+功',
        '法+輪+功',
        '法lun功',
        '法L功',
        '法车仑工力',
        '法功',
        '法国游',
        '法会',
        '法拉盛',
        '法拉盛缅街',
        '法愣',
        '法抡',
        '法抡功',
        '法仑',
        '法伦',
        '法囵',
        '法沦',
        '法纶',
        '法轮',
        '法轮大法',
        '法轮弟子',
        '法轮佛法',
        '法轮功',
        '法倫',
        '法淪',
        '法輪',
        '法輪功',
        '法論',
        '法十轮十功',
        '法一轮',
        '法谪',
        '法谪功',
        '法正',
        '法正乾坤',
        '法正人间',
        '砝仑',
        '砝伦',
        '砝轮',
        '珐(工力)学T',
        '珐.輪功',
        '反党',
        '反动',
        '反对共产党',
        '反对共产主义',
        '反攻大陆',
        '反共',
        '反共传单',
        '反共言论',
        '反华',
        '仿真枪',
        '干 你 妈',
        '干她',
        '干妳',
        '干妳老母',
        '干妳妈',
        '干妳娘',
        '干你',
        '干你妈',
        '干你妈b',
        '干你妈逼',
        '干你娘',
        '干扰器',
        '肛交',
        '肛-交',
        '鸡八',
        '鸡巴',
        '鸡吧',
        '鸡吧鸡巴',
        '乱交',
        '乱交的故事乱伦小说',
        '乱交乱淫乱伦',
        '乱伦',
        '亂倫',
        '抡功',
        '妈逼',
        '妈个',
        '妈批',
        '媽個',
        '日本变态嫖客',
        '日本小泉',
        '日逼',
        '日内瓦金融',
        '日你',
        '日您',
        '日批',
        '日死你',
        '日他',
        '肉棒',
        '肉洞',
        '肉棍',
        '肉穴',
        '肉欲',
        '骚逼',
        '骚妇',
        '骚乱',
        '骚妹',
        '骚媚春情',
        '骚女',
        '骚水',
        '骚穴',
        '我XX你',
        '我操',
        '我操你',
        '我草',
        '阴茎插小穴',
        '阴茎插阴道');
}